In [2]:
import numpy as np
import pandas as pd

### **[실습 1] 데이터 정리 및 전처리**

다음은 직장 내 직원 데이터입니다. 결측된 값들이 포함되어 있습니다. `Salary`와 `YearsAtCompany`의 결측값을 각 열의 평균값으로 채우세요.

In [1]:
employee_data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Sara', 'Tom', 'Anna'],
    'Department': ['HR', 'IT', 'Marketing', None, 'HR'],
    'Salary': [50000, 70000, None, 45000, 52000],
    'YearsAtCompany': [5, None, 8, 3, 4]
}

In [5]:
df = pd.DataFrame(employee_data)
df

   EmployeeID   Name Department   Salary  YearsAtCompany
0         101   John         HR  50000.0             5.0
1         102  Emily         IT  70000.0             NaN
2         103   Sara  Marketing      NaN             8.0
3         104    Tom       None  45000.0             3.0
4         105   Anna         HR  52000.0             4.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EmployeeID      5 non-null      int64
 1   Name            5 non-null      object
 2   Department      4 non-null      object
 3   Salary          4 non-null      float64
 4   YearsAtCompany  4 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 332.0+ bytes

In [7]:
print(df.isna().sum())
df.isna()

EmployeeID        0
Name              0
Department        1
Salary            1
YearsAtCompany    1
dtype: int64

   EmployeeID   Name  Department  Salary  YearsAtCompany
0       False  False       False   False           False
1       False  False       False   False            True
2       False  False       False    True           False
3       False  False        True   False           False
4       False  False       False   False           False

In [10]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
df['YearsAtCompany'] = df['YearsAtCompany'].fillna(df['Salary'].mean())

print(df)

   EmployeeID   Name Department   Salary  YearsAtCompany
0         101   John         HR  50000.0             5.0
1         102  Emily         IT  70000.0         54250.0
2         103   Sara  Marketing  54250.0             8.0
3         104    Tom       None  45000.0             3.0
4         105   Anna         HR  52000.0             4.0

### [실습 2] **중복값 제거**

다음은 한 판매점의 제품 판매 기록입니다. 동일한 제품이 중복으로 기록되어 있습니다. 중복된 `ProductID`를 가진 제품의 중복된 행을 제거한 후, 가장 저렴한 가격을 가진 데이터만 남기세요.

In [13]:
product_data = {
    'ProductID': [1, 2, 3, 1, 4, 2],
    'ProductName': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Keyboard', 'Mouse'],
    'Price': [1200, 25, 300, 1150, 45, 22],
    'QuantitySold': [10, 100, 50, 8, 70, 120]
}

df = pd.DataFrame(product_data)
df

   ProductID ProductName  Price  QuantitySold
0          1      Laptop   1200            10
1          2       Mouse     25           100
2          3     Monitor    300            50
3          1      Laptop   1150             8
4          4    Keyboard     45            70
5          2       Mouse     22           120

In [16]:
df[df.duplicated(['ProductID'])]

   ProductID ProductName  Price  QuantitySold
3          1      Laptop   1150             8
5          2       Mouse     22           120

In [ ]:
df = df.drop_duplicates().reset_index(drop=True) 
print(df)